### Biblioteca Pandas

In [ ]:
# Bibliotecas 

import pandas as pd
import numpy as np

## Series

In [ ]:
#Series é um objeto tipo array, associado a rotulos de dados, chamado índice

obj = pd.Series([4, 7, -5, 3])
obj

In [ ]:
obj.values

In [ ]:
obj.index

In [ ]:
Series = pd.Series([7, 4, 2, np.nan, 6, 9])
Series

In [ ]:
Series.dtype

In [ ]:
obj2 = pd.Series([2, 4, 9, 4, 12], index=['a', 'b', 'c', 'd', 'e'])
obj2

In [ ]:
# Selecionar um elemento da serie, pelo index

obj2['d']

In [ ]:
#Inserir um novo elemento na serie no index d

obj2['d']=7
obj2

In [ ]:
# Operações matematicas

obj2[obj2 > 5]

In [ ]:
# Uma serie criada a partir de um dicionário, as chaves do dicionário será os indices da serie.

sdata = {'Ohin': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
sdata
obj3 = pd.Series(sdata)
obj3

In [ ]:
# Função para criar datas

datas = pd.date_range("20180101", periods = 6) # vem como padrão frequencia em dias defout
datas

In [ ]:
# Para saber mais sobre a função ?

#?pd.date_range

# Para saber mais sobre a estrutura do DataFrame

#?pd.DataFrame

## DataFrame

In [ ]:
# Dados aleatórios de uma distribuição normal

df = pd.DataFrame(np.random.randn(6,4), index = datas, columns = list("ABCD"))
df

In [ ]:
# Um dataframe pode receber diversos tipos de dados

df2 = pd.DataFrame({"A":10,
                    "B":pd.Timestamp("20180102"),
                    "C":pd.Series(1, index = list(range(4)), dtype = "float32"),
                    "D":np.array([3]*4, dtype = "int32"),
                    "E":pd.Categorical(["test", "train", "test", "train"]),
                    "F":"Python" })
df2

In [ ]:
# O tipo de estrutura dos dados

df2.dtypes

In [ ]:
df2.info()

In [ ]:

datas3 = pd.date_range("20190101", periods = 60)

df3 = pd.DataFrame(np.random.rand(60,5), index = datas3, columns = list("ABCDE"))

# metodo trás as 5 primeiras linhas do dataframe:
df3.head()

In [ ]:
df3.tail(4)

In [ ]:
# Método shape nos fornece a dimensão do dataframe linhas e colunas

df3.shape

In [ ]:
#Adicionar nova coluna no dataframe, calculos matemáticos e substituir uma coluna

df3['F'] = 2
df3["Produto"] = df3["A"]*df3["B"]
df3['D']=50
df3['C'] = 12
df3.head()

##  Visualizador de dados

In [ ]:
#Visualizar as duas primeiras linhas do dataframe

df3.head(2)

In [ ]:
#Visualiza as 3 últimas linhas do dataframe

df3.tail(3)

In [ ]:
#retorna somente os index do dataframe

df3.index

In [ ]:
df3.columns

In [ ]:
# Trazer somente os valores dos dados

#df3.to_numpy()

In [ ]:
#Combinar dataframes

df4=pd.DataFrame({"A":["A0", "A1","A2","A3"],
                  "B":["B0", "B1","B2","B3"],
                  "C":["C0", "C1","C2","C3"],
                  "D":["D0", "D1","D2","D3"]},
                index= [0, 1, 2, 3])

df4

In [ ]:
df5=pd.DataFrame({"A":["A4", "A5","A6","A7"],
                  "B":["B4", "B5","B6","B7"],
                  "C":["C4", "C5","C6","C7"],
                  "D":["D4", "D5","D6","D7"]},
                index= [4, 5, 6, 7])
df5

In [ ]:
df6=pd.DataFrame({"A":["A8", "A9","A10","A11"],
                  "B":["B8", "B9","B10","B11"],
                  "C":["C8", "C9","C10","C11"],
                  "D":["D8", "D9","D10","D11"]},
                index= [8, 9, 10, 11])
df6

In [ ]:
# Concatenar os três dataframes
frames = [df4, df5, df6]
frames

In [ ]:
framesCombinação = pd.concat(frames)
framesCombinação

In [ ]:
#Outra forma de concatenar:

data_combinação = pd.concat([df4, df5, df6])

data_combinação

In [ ]:
grupo = pd.concat([df4, df5, df6], keys = ["f1", "f2", "f3"])
grupo

In [ ]:
#Extrair valores do dataframe

grupo["A"]

In [ ]:
#Extrair valores de uma chave

grupo.loc["f2"]

In [ ]:
#Outra forma de concatenar dataframes usando função append

# g1 = df4.append(df5).append(df6)

# g1

##  Método Merge

In [ ]:
# Cadastro da loja a
cadastro_a = {'Id': ['AA2930','BB4563','CC2139','DE2521','GT3462','HH1158'],
            'Nome':  ['Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
            'Idade': [20, 35, 40, 54, 30, 27],
            'CEP': ['00092-029','11111-111','22222-888','00000-999','88888-111','77777-666']
           }

cadastro_a = pd.DataFrame(cadastro_a, columns = ['Id','Nome','Idade','CEP'])
cadastro_a

In [ ]:
# Cadastro da loja b
cadastro_b = {'Id': ['CC9999','EF4488','DD9999','GT3462','HH1158'],
            'Nome':  ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
            'Idade': [19, 30, 22, 30, 27],
            'CEP': ['00092-029','11111-111','11111-888','88888-111','77777-666']
           }
 
cadastro_b = pd.DataFrame(cadastro_b, columns = ['Id','Nome','Idade','CEP'])
cadastro_b

In [ ]:
# Registro de compras de todas unidades

compras = {'Id': ['AA2930','EF4488','CC2139','EF4488','CC9999','AA2930','HH1158','HH1158'],
            'Data':  ['2019-01-01','2019-01-30','2019-01-30','2019-02-01','2019-02-20','2019-03-15','2019-04-01','2019-04-10'],
            'Valor': [200,100,40,150,300,25,50,500]
           }
 
compras = pd.DataFrame(compras, columns = ['Id','Data','Valor'])

compras

In [ ]:
# pd.merge(tabela_da_esquerda, tabela_da_direita, on="coluna_coincidente", how="left|right|inner|outer")

In [ ]:
#Inner realiza a interseção entre os dataframes ( o que tem em comun)


pd.merge(cadastro_a, cadastro_b, on=['Id'], how="inner")

In [ ]:
#função inner, interseção entre os dataframes do cadastro_b não trás o nome

pd.merge(cadastro_a, cadastro_b[['Id', 'Idade', 'CEP']], on='Id', how='inner')

In [ ]:
#join Full juntar tudo que tem nos dois data frames


lojas = pd.concat([cadastro_a, cadastro_b],ignore_index=True)

lojas

In [ ]:
#Exclui Id com repetiação, usamos função drop_duplicates

Clientes_unicos = lojas.drop_duplicates(subset = 'Id')

Clientes_unicos

In [ ]:
# left:leva valores dos dataframe da direita compras para a esquerda cadastro_a


esquerda = pd.merge(cadastro_a, compras, on = ['Id'], how = 'left')
esquerda

#esquerda_s = esquerda.drop_duplicates(subset = "Id")

In [ ]:
cadastro_a

In [ ]:
compras

In [ ]:
# função groupby faz agrupamento pelo id e nome e depois aplica a função soma 

esquerda01 = esquerda.groupby(['Id', 'Nome'])['Valor'].sum()
esquerda01

In [ ]:
#Função groupby

df = pd.DataFrame({"A":['Sim', 'Não', 'Sim', 'Não', 'Não', 'Sim', 'Sim', 'Não'],
                   "B":['Um', 'Um', 'Dois', 'Dois', 'Três', 'Dois', 'Três','Um'],
                   "C": np.random.randn(8),
                   "D": np.random.randn(8)})
df

In [ ]:
#Aplica a função groupby no data frame faz a soma dos valores das colunas numericas em relação as categorias da coluna A


df.groupby(["A"]).sum()

In [ ]:
df.groupby(['B']).sum()

In [ ]:

df.groupby(["A"])['C', 'D'].mean()

In [ ]:
df.groupby(['A', 'B']).sum()

## Indexação

In [ ]:
#Lista

V=[1, 2, 3, 5]

In [ ]:
V[0]

In [ ]:
V[-1]

In [ ]:
V[-4]

In [ ]:
V[0]= 7
V

In [ ]:
#Adiciona um novo valor na lista append()

V.append(8)

In [ ]:
V

In [ ]:
#Substitui o valor do indice 1 por 10

V.insert(1, 12)

In [ ]:
V

In [ ]:
#Excluir o valor do indice 1

V.pop(1)

In [ ]:
V

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
header = pd.MultiIndex.from_product([ ['Período 1','Período 2'],['Matemática','Estatística'] ])

d=([[12,45,67,56],[78,89,45,67],[45,67,89,90],[67,44,56,55]])

In [ ]:
header

In [ ]:
d

In [ ]:
df = pd.DataFrame(d,index=['Pedro','Felipe','Ricardo','Diego'],columns=header)

In [ ]:
df

In [ ]:
dft = df.T

In [ ]:
df.shape

In [ ]:
#Somente os valores da matriz

dft.values

In [ ]:
#quantidade de valores na matriz

np.size(dft)

## Função range

In [ ]:
# Usando função range

for i in range(10):
    print(i)

In [ ]:
valores_dobrados = [valor*2 for valor in range(20)]
valores_dobrados

In [ ]:
var = 'Python'

for i in var:  # o i interante percorre a string que está na variável VAR
    print(i)

In [54]:
#Importar as bibliotecas

import pandas as pd
import numpy as np

In [55]:
#Criar um vetor com 12 dias

Dias = pd.date_range(start = '20190101', periods = 12)
Dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [56]:
#Lista com nomes 

pessoa = ['Gorge', 'Vitor', 'Lucas']
pessoa

['Gorge', 'Vitor', 'Lucas']

In [57]:
# função abaixo escolhe um nome da lista pessoa aleatóriamente


np.random.choice(pessoa)

'Gorge'

In [58]:
#Informar os gastos que essas pessoas fizeram em cada dia do ano

nome = []
gasto = []

for i in range(12):
    nome.append(np.random.choice(pessoa))
    gasto.append(np.round(np.random.rand()*100, 2))

In [59]:
nome

['Vitor',
 'Vitor',
 'Vitor',
 'Vitor',
 'Vitor',
 'Gorge',
 'Gorge',
 'Gorge',
 'Vitor',
 'Vitor',
 'Vitor',
 'Gorge']

In [60]:
gasto

[17.83,
 50.26,
 57.32,
 61.03,
 62.08,
 0.08,
 10.28,
 72.07,
 56.67,
 31.18,
 29.02,
 76.62]

In [61]:
#Criar uma dateframe

df = pd.DataFrame({'Dia': Dias, 'Nome':nome, 'Gasto':gasto})
df

          Dia   Nome  Gasto
0  2019-01-01  Vitor  17.83
1  2019-01-02  Vitor  50.26
2  2019-01-03  Vitor  57.32
3  2019-01-04  Vitor  61.03
4  2019-01-05  Vitor  62.08
5  2019-01-06  Gorge   0.08
6  2019-01-07  Gorge  10.28
7  2019-01-08  Gorge  72.07
8  2019-01-09  Vitor  56.67
9  2019-01-10  Vitor  31.18
10 2019-01-11  Vitor  29.02
11 2019-01-12  Gorge  76.62

In [62]:
#Selecionar linhas de um dataframe

datas = pd.date_range('20230101', periods= 600, freq = 'D')
df = pd.DataFrame(np.random.randn(600,5), index = datas, columns= list('ABCDE'))
df.head()

                   A         B         C         D         E
2023-01-01  0.740268  0.035607 -0.801651  1.090946 -0.474323
2023-01-02  3.724532  1.106958  0.024469  1.362755 -0.677078
2023-01-03 -1.197715  0.176220 -0.321719 -1.137381 -0.659103
2023-01-04  0.330786  0.472078  0.909398  0.929063  1.713308
2023-01-05 -0.046027  0.934139  1.035919  0.559475  0.412689

In [63]:
df['D']

2023-01-01    1.090946
2023-01-02    1.362755
2023-01-03   -1.137381
2023-01-04    0.929063
2023-01-05    0.559475
                ...
2024-08-18    0.224255
2024-08-19   -0.590344
2024-08-20    1.518443
2024-08-21    1.057158
2024-08-22   -0.346406
Freq: D, Name: D, Length: 600, dtype: float64

In [64]:
#Selecionamos todas as linhas das colunas B, C, D

df.loc[:,['B', 'C', 'D']]

                   B         C         D
2023-01-01  0.035607 -0.801651  1.090946
2023-01-02  1.106958  0.024469  1.362755
2023-01-03  0.176220 -0.321719 -1.137381
2023-01-04  0.472078  0.909398  0.929063
2023-01-05  0.934139  1.035919  0.559475
...              ...       ...       ...
2024-08-18 -0.838867 -0.376489  0.224255
2024-08-19 -0.722344 -1.145885 -0.590344
2024-08-20  0.864899  0.586387  1.518443
2024-08-21 -0.550040  1.515818  1.057158
2024-08-22 -0.235367 -1.922112 -0.346406

[600 rows x 3 columns]

In [68]:
#Seleciona todas linhas até a linha definida e selecionada somente a coluna B
df.loc[: '20230104' , 'B']

2023-01-01    0.035607
2023-01-02    1.106958
2023-01-03    0.176220
2023-01-04    0.472078
Freq: D, Name: B, dtype: float64

In [69]:
#Selecionar as linhas e as colunas pelo rotulo

df.loc['20230102':'20230820', ['A','E']].head()

                   A         E
2023-01-02  3.724532 -0.677078
2023-01-03 -1.197715 -0.659103
2023-01-04  0.330786  1.713308
2023-01-05 -0.046027  0.412689
2023-01-06 -1.192180  0.745653

In [70]:
#Seleciona por linha por index
df.iloc[1]

A    3.724532
B    1.106958
C    0.024469
D    1.362755
E   -0.677078
Name: 2023-01-02 00:00:00, dtype: float64

In [71]:
df[1:5]

                   A         B         C         D         E
2023-01-02  3.724532  1.106958  0.024469  1.362755 -0.677078
2023-01-03 -1.197715  0.176220 -0.321719 -1.137381 -0.659103
2023-01-04  0.330786  0.472078  0.909398  0.929063  1.713308
2023-01-05 -0.046027  0.934139  1.035919  0.559475  0.412689

In [72]:
#Selecionar linhas e colunas pelos indices

df.iloc[1:5, 1:3]

                   B         C
2023-01-02  1.106958  0.024469
2023-01-03  0.176220 -0.321719
2023-01-04  0.472078  0.909398
2023-01-05  0.934139  1.035919

In [73]:
df.iloc[[1, 2, 4], [1, 3, 4]]

                   B         D         E
2023-01-02  1.106958  1.362755 -0.677078
2023-01-03  0.176220 -1.137381 -0.659103
2023-01-05  0.934139  0.559475  0.412689

In [74]:
#Tudo que estiver antes da virgula representa as linhas após as colunas

df.iloc[1:5, :]

                   A         B         C         D         E
2023-01-02  3.724532  1.106958  0.024469  1.362755 -0.677078
2023-01-03 -1.197715  0.176220 -0.321719 -1.137381 -0.659103
2023-01-04  0.330786  0.472078  0.909398  0.929063  1.713308
2023-01-05 -0.046027  0.934139  1.035919  0.559475  0.412689

In [78]:
#Importar arquivos externos em EXCEL

dados = pd.read_csv('C:/Users/Samsung/Datasets/dados.csv')

In [79]:
dados

       UF  Sexo  Idade  Cor  Anos de Estudo  Renda    Altura
0      11     0     23    8              12    800  1.603808
1      11     1     23    2              12   1150  1.739790
2      11     1     35    8              15    880  1.760444
3      11     0     46    2               6   3500  1.783158
4      11     1     47    8               9    150  1.690631
...    ..   ...    ...  ...             ...    ...       ...
76835  53     1     46    2              11    812  1.687030
76836  53     0     30    4               7   1500  1.792934
76837  53     0     32    8              12   1300  1.830587
76838  53     0     57    8               4   1500  1.726344
76839  53     0     38    8               4    900  1.658305

[76840 rows x 7 columns]

In [81]:
dados.loc[:, ['Sexo', 'Idade', 'Anos de Estudo']]

       Sexo  Idade  Anos de Estudo
0         0     23              12
1         1     23              12
2         1     35              15
3         0     46               6
4         1     47               9
...     ...    ...             ...
76835     1     46              11
76836     0     30               7
76837     0     32              12
76838     0     57               4
76839     0     38               4

[76840 rows x 3 columns]

In [82]:
dados.iloc[:, [1, 2, 4]]

       Sexo  Idade  Anos de Estudo
0         0     23              12
1         1     23              12
2         1     35              15
3         0     46               6
4         1     47               9
...     ...    ...             ...
76835     1     46              11
76836     0     30               7
76837     0     32              12
76838     0     57               4
76839     0     38               4

[76840 rows x 3 columns]

In [ ]:
#GRÁFICOS
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
dados.shape

In [ ]:
dados.Idade.plot()
plt.show()

In [ ]:
dados.Idade.describe()

In [ ]:
dados.Idade.hist()

plt.show()

In [ ]:
#pip install pandas-profiling

In [ ]:
#import pandas_profiling as pp

In [ ]:
#report = pp.ProfileReport(dados)
#report.to_file('report.html')
#report

In [ ]:
dados

In [ ]:
dados.head(2)

In [ ]:
dados['Sexo'].head(5)

In [ ]:
dados.head(10)

In [ ]:
# Lê as 10 primeiras linhas do dataframe

dados[1:11]

In [ ]:
# Seleciona apenas as colunas idade, sexo e doença existente e lê todas as colunas

dados.loc[:, ['Idade', 'Sexo', 'Doença existente']]

In [ ]:
# Lê a linha 10 do dataframe

dados.iloc[10]

## Datas

In [11]:
#Biblioteca para trabalhar com data
import pandas as pd
from datetime import datetime, timedelta

In [3]:
data = datetime.date(2024, 8, 6)
print(data)

2024-08-06

In [4]:
#Separando a data
ano = data.year
mes = data.month
dia = data.day

In [5]:
print(ano, mes, dia)

2024 8 6

In [6]:
nova_data = data.replace(day = 10)
print(nova_data)

2024-08-10

In [7]:
#data do dia 
hoje = datetime.date.today()
print(hoje)

2024-08-07

In [8]:
#Operações com data
delta = hoje - nova_data
print(delta)

-3 days, 0:00:00

In [14]:
amanha = hoje + timedelta(days=1)
print(amanha)

2024-08-08

In [21]:
data_contrato = '12/05/2024'
data_contrato = datetime.strptime(data_contrato, "%d/%m/%Y")
print(data_contrato)

2024-05-12 00:00:00

In [24]:
data_prova = '12/05/2024'
pd.to_datetime(data_prova, format='%d/%m/%Y')

Timestamp('2024-05-12 00:00:00')